AlmAck/svdtonuttx/demo/h/da1470_gpu_core.h
/* Register addresses *******************************************************/

#define DA1470_GPU_CORE_BASE                             0x51001200 /* GPU_CORE registers */

#define DA1470_GPU_CORE_D2_CACHECTL                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_CACHECTL_OFFSET) /* #49: cache control register
  Internal caches can be enabled/disabled and flushe */
#define DA1470_GPU_CORE_D2_COLKEY                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_COLKEY_OFFSET) /* #58: Color key value
  The R, G and B components of the internal color represent */
#define DA1470_GPU_CORE_D2_COLOR1                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_COLOR1_OFFSET) /* #25: Base color register
  All color registers are *write only*, reading will re */
#define DA1470_GPU_CORE_D2_COLOR2                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_COLOR2_OFFSET) /* #26: Secondary color register
  Secondary color is relevant only when rendering  */
#define DA1470_GPU_CORE_D2_CONTROL                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_CONTROL_OFFSET) /* #0: geometry control register 
  This register controls the pixel enumeration an */
#define DA1470_GPU_CORE_D2_CONTROL2                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_CONTROL2_OFFSET) /* #1: surface control register
  This register controls the colorization, texturin */
#define DA1470_GPU_CORE_D2_CONTROL3                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_CONTROL3_OFFSET) /* #2: burst length limit control register
  This register controls the burst lengt */
#define DA1470_GPU_CORE_D2_DLISTSTART                    (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_DLISTSTART_OFFSET) /* #50: Displaylist start address
  Setting a new displaylist base address (writing */
#define DA1470_GPU_CORE_D2_HWREVISION                    (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_HWREVISION_OFFSET) /* #1: hardware version and feature set ID
  Read this (constant) register to ident */
#define DA1470_GPU_CORE_D2_IRQCTL                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_IRQCTL_OFFSET) /* #48: interrupt control register
  DAVE2 features three sources for interrupts. T */
#define DA1470_GPU_CORE_D2_L1BAND                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L1BAND_OFFSET) /* #22: Limiter1 band width parameter
  Postfilter
 First two limiter outputs can b */
#define DA1470_GPU_CORE_D2_L1START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L1START_OFFSET) /* #4: Limiter1 start value
  All limiter registers are *write only*, reading will  */
#define DA1470_GPU_CORE_D2_L1XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L1XADD_OFFSET) /* #10: Limiter1 X-Axis increment
  The xadd value is the 16:16 fixedpoint differen */
#define DA1470_GPU_CORE_D2_L1YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L1YADD_OFFSET) /* #16: Limiter1 Y-Axis increment
  The yadd value is the 16:16 fixedpoint differen */
#define DA1470_GPU_CORE_D2_L2BAND                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L2BAND_OFFSET) /* #23: Limiter2 band width parameter
  see &lt;D2_L1BAND&gt; */
#define DA1470_GPU_CORE_D2_L2START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L2START_OFFSET) /* #5: Limiter2 start value
  see &lt;D2_L1START&gt; */
#define DA1470_GPU_CORE_D2_L2XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L2XADD_OFFSET) /* #11: Limiter2 X-Axis increment
  see &lt;D2_L1XADD&gt; */
#define DA1470_GPU_CORE_D2_L2YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L2YADD_OFFSET) /* #17: Limiter2 Y-Axis increment
  see &lt;D2_L1YADD&gt; */
#define DA1470_GPU_CORE_D2_L3START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L3START_OFFSET) /* #6: Limiter3 start value
  see &lt;D2_L1START&gt; */
#define DA1470_GPU_CORE_D2_L3XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L3XADD_OFFSET) /* #12: Limiter3 X-Axis increment */
#define DA1470_GPU_CORE_D2_L3YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L3YADD_OFFSET) /* #18: Limiter3 Y-Axis increment
  see &lt;D2_L1YADD&gt; */
#define DA1470_GPU_CORE_D2_L4START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L4START_OFFSET) /* #7: Limiter4 start value
  see &lt;D2_L1START&gt; */
#define DA1470_GPU_CORE_D2_L4XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L4XADD_OFFSET) /* #13: Limiter4 X-Axis increment
  see &lt;D2_L1XADD&gt; */
#define DA1470_GPU_CORE_D2_L4YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L4YADD_OFFSET) /* #19: Limiter4 Y-Axis increment
  see &lt;D2_L1YADD&gt; */
#define DA1470_GPU_CORE_D2_L5START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L5START_OFFSET) /* #8: Limiter5 start value
  see &lt;D2_L1START&gt; */
#define DA1470_GPU_CORE_D2_L5XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L5XADD_OFFSET) /* #14: Limiter5 X-Axis increment
  see &lt;D2_L1XADD&gt; */
#define DA1470_GPU_CORE_D2_L5YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L5YADD_OFFSET) /* #20: Limiter5 Y-Axis increment
  see &lt;D2_L1YADD&gt; */
#define DA1470_GPU_CORE_D2_L6START                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L6START_OFFSET) /* #9: Limiter6 start value
  see &lt;D2_L1START&gt; */
#define DA1470_GPU_CORE_D2_L6XADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L6XADD_OFFSET) /* #15: Limiter6 X-Axis increment
  see &lt;D2_L1XADD&gt; */
#define DA1470_GPU_CORE_D2_L6YADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_L6YADD_OFFSET) /* #21: Limiter6 Y-Axis increment
  see &lt;D2_L1YADD&gt; */
#define DA1470_GPU_CORE_D2_LUSTART                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LUSTART_OFFSET) /* #36: U Limiter start value
  The start value is a 16:16 fixedpoint number valid  */
#define DA1470_GPU_CORE_D2_LUXADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LUXADD_OFFSET) /* #37: U Limiter X-Axis increment
  The add value for U is the 16:16 fixedpoint di */
#define DA1470_GPU_CORE_D2_LUYADD                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LUYADD_OFFSET) /* #38: U Limiter Y-Axis increment
  The add value for U is the 16:16 fixedpoint di */
#define DA1470_GPU_CORE_D2_LVSTARTF                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LVSTARTF_OFFSET) /* #40: V Limiter start value fractional part
  The start value is a 32:16 fixedpoi */
#define DA1470_GPU_CORE_D2_LVSTARTI                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LVSTARTI_OFFSET) /* #39: V Limiter start value integer part */
#define DA1470_GPU_CORE_D2_LVXADDI                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LVXADDI_OFFSET) /* #41: V Limiter X-Axis increment integer part
  The add value for V is the 32:16  */
#define DA1470_GPU_CORE_D2_LVYADDI                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LVYADDI_OFFSET) /* #42: V Limiter Y-Axis increment integer part
  The add value for V is the 32:16  */
#define DA1470_GPU_CORE_D2_LVYXADDF                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_LVYXADDF_OFFSET) /* #43: V Limiter X and Y increment fractional parts */
#define DA1470_GPU_CORE_D2_ORIGIN                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_ORIGIN_OFFSET) /* #32: address of the first pixel in framebuffer
  Writing to &lt;D2_ORIGIN&gt; wi */
#define DA1470_GPU_CORE_D2_PATTERN                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_PATTERN_OFFSET) /* #29: Pattern register
  Each bit in the pattern register is interpreted as a ref */
#define DA1470_GPU_CORE_D2_PERFCOUNT1                    (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_PERFCOUNT1_OFFSET) /* #51: Performance counter
  Writing to the D2_PERFCOUNT1 register resets the firs */
#define DA1470_GPU_CORE_D2_PERFCOUNT2                    (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_PERFCOUNT2_OFFSET) /* #52: Performance counter
  Writing to the D2_PERFCOUNT2 register resets the seco */
#define DA1470_GPU_CORE_D2_PERFTRIGGER                   (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_PERFTRIGGER_OFFSET) /* #53: Performance counters control register
  Select the internal event that will */
#define DA1470_GPU_CORE_D2_PITCH                         (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_PITCH_OFFSET) /* #31: framebuffer pitch and spanstore delay */
#define DA1470_GPU_CORE_D2_SIZE                          (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_SIZE_OFFSET) /* #30: bounding box dimension */
#define DA1470_GPU_CORE_D2_STATUS                        (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_STATUS_OFFSET) /* #0: status control register
  The current dave status can be polled by reading t */
#define DA1470_GPU_CORE_D2_TEXCLUT                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXCLUT_OFFSET) /* #54: Color Lookup Table for the indexed texture format 16x24bit
  Triggers a wri */
#define DA1470_GPU_CORE_D2_TEXCLUT_ADDR                  (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXCLUT_ADDR_OFFSET) /* #55: Color Lookup Table write address for the indexed texture format 256x32bit
  */
#define DA1470_GPU_CORE_D2_TEXCLUT_DATA                  (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXCLUT_DATA_OFFSET) /* #56: Color Lookup Table write data for the indexed texture format 256x32bit
  Wr */
#define DA1470_GPU_CORE_D2_TEXCLUT_OFFSET                (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXCLUT_OFFSET_OFFSET) /* #57: Offset to the texture index for the indexed texture formats i8, i4, i2 and  */
#define DA1470_GPU_CORE_D2_TEXMASK                       (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXMASK_OFFSET) /* #46: Texture size or texture address mask
  Depending on the clamping mode this  */
#define DA1470_GPU_CORE_D2_TEXORIGIN                     (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXORIGIN_OFFSET) /* #47: Texture base address
  All texture registers are *write only*, reading will */
#define DA1470_GPU_CORE_D2_TEXPITCH                      (DA1470_GPU_CORE_BASE + DA1470_GPU_CORE_D2_TEXPITCH_OFFSET) /* #45: Texels per texture line
  Pitch is equal or bigger than texture width. */

/* Register bit definitions *************************************************/

