AlmAck/svdtonuttx/demo/h/da1470_gpu_core.h
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_TX       (1U << 3) /* Flush texture cache */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_TX      (1U << 2) /* Texture cache enable */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_FB       (1U << 1) /* Flush framebuffer cache */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_FB      (1U << 0) /* Framebuffer cache enable */
#define GPU_CORE_D2_COLKEY_COLKEY_RGB_MASK               (0xFFFFFF << 0) /* Color Key Value RGB888 */
#define GPU_CORE_D2_COLKEY_COLKEY_RGB_POS                (0) /* Color Key Value RGB888 */
#define GPU_CORE_D2_COLOR1_COLOR1_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_COLOR1_COLOR1_POS                    (0) /* No description available. */
#define GPU_CORE_D2_COLOR2_COLOR2_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_COLOR2_COLOR2_POS                    (0) /* No description available. */
#define GPU_CORE_D2_CONTROL_D2C_LIMITERPRECISION         (1U << 24) /* increase precision of limiters from 16.16 to 10.22 */
#define GPU_CORE_D2_CONTROL_D2C_SPANSTORE                (1U << 23) /* nextline span start is always equal or left to current-line span start */
#define GPU_CORE_D2_CONTROL_D2C_SPANABORT                (1U << 22) /* shape is horizontally convex. only a single span per scanline */
#define GPU_CORE_D2_CONTROL_D2C_UNIONCD                  (1U << 21) /* combine outputs C & D as union (output is final) */
#define GPU_CORE_D2_CONTROL_D2C_UNIONAB                  (1U << 20) /* combine outputs A & B as union (output is called C) */
#define GPU_CORE_D2_CONTROL_D2C_UNION56                  (1U << 19) /* combine limter 5 & 6 as union (output is called D) */
#define GPU_CORE_D2_CONTROL_D2C_UNION34                  (1U << 18) /* combine limter 3 & 4 as union (output is called B) */
#define GPU_CORE_D2_CONTROL_D2C_UNION12                  (1U << 17) /* combine limter 1 & 2 as union (output is called A) */
#define GPU_CORE_D2_CONTROL_D2C_BAND2ENABLE              (1U << 16) /* enable band postprocess for limiter 2 (see <D2_L2BAND>) */
#define GPU_CORE_D2_CONTROL_D2C_BAND1ENABLE              (1U << 15) /* enable band postprocess for limiter 1 (see <D2_L1BAND>) */
#define GPU_CORE_D2_CONTROL_D2C_LIM6THRESHOLD            (1U << 14) /* enable limiter 6 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_LIM5THRESHOLD            (1U << 13) /* enable limiter 5 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_LIM4THRESHOLD            (1U << 12) /* enable limiter 4 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_LIM3THRESHOLD            (1U << 11) /* enable limiter 3 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_LIM2THRESHOLD            (1U << 10) /* enable limiter 2 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_LIM1THRESHOLD            (1U << 9) /* enable limiter 1 threshold mode */
#define GPU_CORE_D2_CONTROL_D2C_QUAD3ENABLE              (1U << 8) /* enable quadratic coupling of limiters 5 and 6 */
#define GPU_CORE_D2_CONTROL_D2C_QUAD2ENABLE              (1U << 7) /* enable quadratic coupling of limiters 3 and 4 */
#define GPU_CORE_D2_CONTROL_D2C_QUAD1ENABLE              (1U << 6) /* enable quadratic coupling of limiters 1 and 2 */
#define GPU_CORE_D2_CONTROL_D2C_LIM6ENABLE               (1U << 5) /* enable limiter 6 */
#define GPU_CORE_D2_CONTROL_D2C_LIM5ENABLE               (1U << 4) /* enable limiter 5 */
#define GPU_CORE_D2_CONTROL_D2C_LIM4ENABLE               (1U << 3) /* enable limiter 4 */
#define GPU_CORE_D2_CONTROL_D2C_LIM3ENABLE               (1U << 2) /* enable limiter 3 */
#define GPU_CORE_D2_CONTROL_D2C_LIM2ENABLE               (1U << 1) /* enable limiter 2 */
#define GPU_CORE_D2_CONTROL_D2C_LIM1ENABLE               (1U << 0) /* enable limiter 1 */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT2              (1U << 31) /* bit1 of RLE texel format */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT1              (1U << 30) /* bit0 of RLE texel format */
#define GPU_CORE_D2_CONTROL2_D2C_BDIA                    (1U << 29) /* dst factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on B */
#define GPU_CORE_D2_CONTROL2_D2C_BSIA                    (1U << 28) /* src factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on B */
#define GPU_CORE_D2_CONTROL2_D2C_CLUTFORMAT1             (1U << 27) /* bit0 of the CLUT entry format */
#define GPU_CORE_D2_CONTROL2_D2C_COLKEY_ENABLE           (1U << 26) /* enable color keying (see also <D2_COLKEY> and feature bits of <D2_HWREVISION>) */
#define GPU_CORE_D2_CONTROL2_D2C_CLUT_ENABLE             (1U << 25) /* enable the use of the CLUT (see also feature bits of <D2_HWREVISION>); if disabl */
#define GPU_CORE_D2_CONTROL2_D2C_RLE_ENABLE              (1U << 24) /* enable RLE decoder (see also feature bits of <D2_HWREVISION>) */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA2             (1U << 23) /* bit1 of the 'alpha source' (depends on USE_ACB) */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA1             (1U << 22) /* bit0 of the 'alpha source' (depends on USE_ACB) */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT2            (1U << 21) /* bit1 of the framebuffer format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT1            (1U << 20) /* bit0 of the framebuffer format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT2             (1U << 19) /* bit1 of the texture format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT1             (1U << 18) /* bit0 of the texture format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERY          (1U << 17) /* linear filtering on texture v axis */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERX          (1U << 16) /* linear filtering on texture u axis */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPY           (1U << 15) /* clamp instead of mask v coordinate */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPX           (1U << 14) /* clamp instead of mask u coordinate */
#define GPU_CORE_D2_CONTROL2_D2C_BC2                     (1U << 13) /* blending for color channels is done with <D2_COLOR2> instead of the real dst val */
#define GPU_CORE_D2_CONTROL2_D2C_BDI                     (1U << 12) /* dst factor for color channels will be inverted (meaning 1-a or 1-1 depending on  */
#define GPU_CORE_D2_CONTROL2_D2C_BSI                     (1U << 11) /* src factor for color channels will be inverted (meaning 1-a or 1-1 depending on  */
#define GPU_CORE_D2_CONTROL2_D2C_BDF                     (1U << 10) /* dst factor for color channels is alpha (factor is 1 per default) */
#define GPU_CORE_D2_CONTROL2_D2C_BSF                     (1U << 9) /* src factor for color channels is alpha (factor is 1 per default) */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT3            (1U << 8) /* bit2 of the framebuffer format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_BDFA                    (1U << 7) /* dst factor for alpha channel is alpha (factor is 1 per default) */
#define GPU_CORE_D2_CONTROL2_D2C_BSFA                    (1U << 6) /* src factor for alpha channel is alpha (factor is 1 per default) */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT4             (1U << 5) /* bit3 of the texture format descriptor */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT3             (1U << 4) /* bit2 of the texture format descriptor */
#define GPU_CORE_D2_CONTROL2_USE_ACB                     (1U << 3) /* use full alpha channel blending, else use write-alpha mode */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNSOURCEL5         (1U << 2) /* Limiter 5 is used as pattern index instead of the default U-Limiter */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREENABLE           (1U << 1) /* Pixel source is read from texture and used as an alpha to blend between <D2_COLO */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNENABLE           (1U << 0) /* Pixel source is a pattern color (blend of <D2_COLOR1> and <D2_COLOR2> depending  */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MDL_MASK        (0x7 << 24) /* Log2 of the burst length limit for MDL read */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MDL_POS         (24) /* Log2 of the burst length limit for MDL read */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MTX_MASK        (0x7 << 16) /* Log2 of the burst length limit for MTX read */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MTX_POS         (16) /* Log2 of the burst length limit for MTX read */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBW_MASK       (0x7 << 8) /* Log2 of the burst length limit for MFB write */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBW_POS        (8) /* Log2 of the burst length limit for MFB write */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBR_MASK       (0x7 << 0) /* Log2 of the burst length limit for MFB read */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBR_POS        (0) /* Log2 of the burst length limit for MFB read */
#define GPU_CORE_D2_DLISTSTART_DLISTSTART_MASK           (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_DLISTSTART_DLISTSTART_POS            (0) /* No description available. */
#define GPU_CORE_D2_HWREVISION_FB_BURSTSPLITTING         (1U << 28) /* bursts can be split with respect to burst length limit */
#define GPU_CORE_D2_HWREVISION_FB_ALPHACHANNELBLENDING   (1U << 27) /* full alpha channel blending available */
#define GPU_CORE_D2_HWREVISION_FB_HILIMITERPRECISION     (1U << 26) /* increasable precision of limiters available */
#define GPU_CORE_D2_HWREVISION_FB_COLORKEY               (1U << 25) /* color keying available */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT256             (1U << 24) /* extend CLUT to 256x32bit ARGB8888 */
#define GPU_CORE_D2_HWREVISION_FB_RLEUNIT                (1U << 23) /* RLE texture decoder available */
#define GPU_CORE_D2_HWREVISION_FB_FBPREFETCH             (1U << 22) /* Framebuffer prefetch available */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT                (1U << 21) /* Color Lookup Table 16x24bit for indexed textureformat available */
#define GPU_CORE_D2_HWREVISION_FB_PERFCOUNT              (1U << 20) /* Two performance counters available */
#define GPU_CORE_D2_HWREVISION_FB_TXCACHE                (1U << 19) /* Texture Cache available */
#define GPU_CORE_D2_HWREVISION_FB_FBCACHE                (1U << 18) /* Framebuffer Cache available */
#define GPU_CORE_D2_HWREVISION_FB_DLR                    (1U << 17) /* DisplayListReader available */
#define GPU_CORE_D2_HWREVISION_FB_SWDAVE                 (1U << 16) /* Software D/AVE */
#define GPU_CORE_D2_HWREVISION_HWTYPE_MASK               (0xF << 12) /* D/AVE Type */
#define GPU_CORE_D2_HWREVISION_HWTYPE_POS                (12) /* D/AVE Type */
#define GPU_CORE_D2_HWREVISION_HWBRANCH_MASK             (0xF << 8) /* Branch number */
#define GPU_CORE_D2_HWREVISION_HWBRANCH_POS              (8) /* Branch number */
#define GPU_CORE_D2_HWREVISION_HWREVISION_MASK           (0xFF << 0) /* Revision number */
#define GPU_CORE_D2_HWREVISION_HWREVISION_POS            (0) /* Revision number */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_BUS_ERROR        (1U << 5) /* Clear Interrupt 'Bus error' */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_BUS_ERROR     (1U << 4) /* Interruptmask enable 'Bus error' */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_DLIST     (1U << 3) /* Clear Interrupt 'Displaylist is finished'. Make sure to clear the IRQ before sta */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_ENUM      (1U << 2) /* Clear Interrupt 'Enumeration is finished' */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_DLIST  (1U << 1) /* Interruptmask enable 'Displaylist is finished' */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_ENUM   (1U << 0) /* Interruptmask enable 'Enumeration is finished' */
#define GPU_CORE_D2_L1BAND_L1BAND_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L1BAND_L1BAND_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L1START_L1START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L1START_L1START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L1XADD_L1XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L1XADD_L1XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L1YADD_L1YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L1YADD_L1YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L2BAND_L2BAND_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L2BAND_L2BAND_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L2START_L2START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L2START_L2START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L2XADD_L2XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L2XADD_L2XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L2YADD_L2YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L2YADD_L2YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L3START_L3START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L3START_L3START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L3XADD_L3XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L3XADD_L3XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L3YADD_L3YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L3YADD_L3YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L4START_L4START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L4START_L4START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L4XADD_L4XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L4XADD_L4XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L4YADD_L4YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L4YADD_L4YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L5START_L5START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L5START_L5START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L5XADD_L5XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L5XADD_L5XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L5YADD_L5YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L5YADD_L5YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L6START_L6START_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L6START_L6START_POS                  (0) /* No description available. */
#define GPU_CORE_D2_L6XADD_L6XADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L6XADD_L6XADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_L6YADD_L6YADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_L6YADD_L6YADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_LUSTART_LUSTART_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LUSTART_LUSTART_POS                  (0) /* No description available. */
#define GPU_CORE_D2_LUXADD_LUXADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LUXADD_LUXADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_LUYADD_LUYADD_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LUYADD_LUYADD_POS                    (0) /* No description available. */
#define GPU_CORE_D2_LVSTARTF_LVSTARTF_MASK               (0xFFFF << 0) /* fractional part. */
#define GPU_CORE_D2_LVSTARTF_LVSTARTF_POS                (0) /* fractional part. */
#define GPU_CORE_D2_LVSTARTI_LVSTARTI_MASK               (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LVSTARTI_LVSTARTI_POS                (0) /* No description available. */
#define GPU_CORE_D2_LVXADDI_LVXADDI_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LVXADDI_LVXADDI_POS                  (0) /* No description available. */
#define GPU_CORE_D2_LVYADDI_LVYADDI_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_LVYADDI_LVYADDI_POS                  (0) /* No description available. */
#define GPU_CORE_D2_LVYXADDF_D2_LVYADDI_FRAC_MASK        (0xFFFF << 16) /* Y increment fractional part for <D2_LVYADDI>. */
#define GPU_CORE_D2_LVYXADDF_D2_LVYADDI_FRAC_POS         (16) /* Y increment fractional part for <D2_LVYADDI>. */
#define GPU_CORE_D2_LVYXADDF_D2_LVXADDI_FRAC_MASK        (0xFFFF << 0) /* X increment fractional part for <D2_LVXADDI>. */
#define GPU_CORE_D2_LVYXADDF_D2_LVXADDI_FRAC_POS         (0) /* X increment fractional part for <D2_LVXADDI>. */
#define GPU_CORE_D2_ORIGIN_ORIGIN_MASK                   (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_ORIGIN_ORIGIN_POS                    (0) /* No description available. */
#define GPU_CORE_D2_PATTERN_PATTERN_MASK                 (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_PATTERN_PATTERN_POS                  (0) /* No description available. */
#define GPU_CORE_D2_PERFCOUNT1_PERFCOUNT1_MASK           (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_PERFCOUNT1_PERFCOUNT1_POS            (0) /* No description available. */
#define GPU_CORE_D2_PERFCOUNT2_PERFCOUNT2_MASK           (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_PERFCOUNT2_PERFCOUNT2_POS            (0) /* No description available. */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER2_MASK        (0xFFFF << 16) /* Select the internal event that will increment D2_PERFCOUNT2 register. */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER2_POS         (16) /* Select the internal event that will increment D2_PERFCOUNT2 register. */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER1_MASK        (0xFFFF << 0) /* Select the internal event that will increment D2_PERFCOUNT1 register. */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER1_POS         (0) /* Select the internal event that will increment D2_PERFCOUNT1 register. */
#define GPU_CORE_D2_PITCH_SSD_MASK                       (0xFFFF << 16) /* spanstore delay, the number of scanlines to delay spanstore operations. */
#define GPU_CORE_D2_PITCH_SSD_POS                        (16) /* spanstore delay, the number of scanlines to delay spanstore operations. */
#define GPU_CORE_D2_PITCH_PITCH_MASK                     (0xFFFF << 0) /* the width (in pixels) of one framebuffer scanline. A negative width can be used  */
#define GPU_CORE_D2_PITCH_PITCH_POS                      (0) /* the width (in pixels) of one framebuffer scanline. A negative width can be used  */
#define GPU_CORE_D2_SIZE_SIZEY_MASK                      (0xFFFF << 16) /* the height (in pixels) of the primitives bounding box. */
#define GPU_CORE_D2_SIZE_SIZEY_POS                       (16) /* the height (in pixels) of the primitives bounding box. */
#define GPU_CORE_D2_SIZE_SIZEX_MASK                      (0xFFFF << 0) /* the width (in pixels) of the primitives bounding box. */
#define GPU_CORE_D2_SIZE_SIZEX_POS                       (0) /* the width (in pixels) of the primitives bounding box. */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_SRC_MASK    (0x7 << 8) /* source interface of bus error */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_SRC_POS     (8) /* source interface of bus error */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR             (1U << 6) /* IRQ on bus error */
#define GPU_CORE_D2_STATUS_D2C_IRQ_DLIST                 (1U << 5) /* IRQ on display list finish */
#define GPU_CORE_D2_STATUS_D2C_IRQ_ENUM                  (1U << 4) /* IRQ on enumeration finish */
#define GPU_CORE_D2_STATUS_D2C_DLISTACTIVE               (1U << 3) /* display list active, cant direct access hwregs */
#define GPU_CORE_D2_STATUS_D2C_CACHE_DIRTY               (1U << 2) /* framebuffer cache dirty, cant flip frame */
#define GPU_CORE_D2_STATUS_D2C_BUSY_WRITE                (1U << 1) /* framebuffer writeback busy, cant change framebuffer type */
#define GPU_CORE_D2_STATUS_D2C_BUSY_ENUM                 (1U << 0) /* enumeration unit busy, cant start new primitive */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_INDEX_MASK           (0xFF << 24) /* Index of the CLUT entry, that shall be written */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_INDEX_POS            (24) /* Index of the CLUT entry, that shall be written */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_RGB_MASK             (0xFFFFFF << 0) /* Color Value RGB888 */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_RGB_POS              (0) /* Color Value RGB888 */
#define GPU_CORE_D2_TEXCLUT_ADDR_TEXCLUT_ADDR_MASK       (0xFF << 0) /* write address */
#define GPU_CORE_D2_TEXCLUT_ADDR_TEXCLUT_ADDR_POS        (0) /* write address */
#define GPU_CORE_D2_TEXCLUT_DATA_TEXCLUT_ARGB_MASK       (0xFFFFFFFF << 0) /* Color value ARGB8888 if CLUTFORMAT = argb8888 */
#define GPU_CORE_D2_TEXCLUT_DATA_TEXCLUT_ARGB_POS        (0) /* Color value ARGB8888 if CLUTFORMAT = argb8888 */
#define GPU_CORE_D2_TEXCLUT_OFFSET_TEXCLUT_OFFSET_MASK   (0xFF << 0) /* index offset */
#define GPU_CORE_D2_TEXCLUT_OFFSET_TEXCLUT_OFFSET_POS    (0) /* index offset */
#define GPU_CORE_D2_TEXMASK_TEXVMASK_MASK                (0x1FFFFF << 11) /* V mask. */
#define GPU_CORE_D2_TEXMASK_TEXVMASK_POS                 (11) /* V mask. */
#define GPU_CORE_D2_TEXMASK_TEXUMASK_MASK                (0x7FF << 0) /* U mask. */
#define GPU_CORE_D2_TEXMASK_TEXUMASK_POS                 (0) /* U mask. */
#define GPU_CORE_D2_TEXORIGIN_TEXORIGIN_MASK             (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_TEXORIGIN_TEXORIGIN_POS              (0) /* No description available. */
#define GPU_CORE_D2_TEXPITCH_TEXPITCH_MASK               (0xFFFFFFFF << 0) /* No description available. */
#define GPU_CORE_D2_TEXPITCH_TEXPITCH_POS                (0) /* No description available. */

#endif /* __DA1470_GPU_CORE_H */
